# Intro to Pandas

## Data Alignment

1. Basic Imports

In [1]:
# Imports
import pandas as pd
import numpy as np

### Use the following Data Frames

In [2]:
# First df
df1 = pd.DataFrame(np.arange(4).reshape(2,2),columns=list('AB'),index=['Berlin','Moscow'])

# Show
df1

        A  B
Berlin  0  1
Moscow  2  3

Creation of the second DF

In [3]:
#Second DataFrame
df2 = pd.DataFrame(np.arange(9).reshape(3,3),columns=list('ABC'),index=['Berlin','Moscow','Turin'])

#Show
df2

        A  B  C
Berlin  0  1  2
Moscow  3  4  5
Turin   6  7  8

2. Add the two data frames and fill the NaN values with 10. Use the add() method.

In [6]:
# Add df1 and df2
df1.add(df2, fill_value=10)

           A     B     C
Berlin   0.0   2.0  12.0
Moscow   5.0   7.0  15.0
Turin   16.0  17.0  18.0

## Operations betwen a Series and a DataFrame

3. Grab the row with index 1 from the df1 and save it in a new variable named 'ser1'

In [8]:
#Create a Series from DataFrame's 1 row
ser1 = df1.iloc[1]

#Show
ser1

A    2
B    3
Name: Moscow, dtype: int64

4. Subtract ser1 from the df2

In [11]:
# Subtraction
df2.subtract(ser1)

          A    B   C
Berlin -2.0 -2.0 NaN
Moscow  1.0  1.0 NaN
Turin   4.0  4.0 NaN

5. Multiply the ser1 to the df2

In [12]:
# Multiply
df2.multiply(ser1)

           A     B   C
Berlin   0.0   3.0 NaN
Moscow   6.0  12.0 NaN
Turin   12.0  21.0 NaN

# The End!